import streamlit as st
import plotly.graph_objects as go
import pandas as pd

# Функция загрузки данных с кэшированием
@st.cache_data
def get_data(d_start, d_end, val):
    try:
        # Формируем запрос в центральный банк
        url_cb = 'https://www.cbr.ru/scripts/XML_dynamic.asp?'
        date_req1 = 'date_req1='
        date_req2 = '&date_req2='
        VAL_NM_RQ = '&VAL_NM_RQ='
        url = url_cb + date_req1 + d_start + date_req2 + d_end + VAL_NM_RQ + val
        dat = pd.read_xml(url)
        # Заменяем запятые на точки в столбце с валютой
        dat['Value'] = dat['Value'].str.replace(',', '.')
        # Преобразуем строки в числа в столбце с валютой
        dat['Value'] = dat['Value'].astype(float)
        # В дате заменяем точки на "-"
        dat['Date'] = dat['Date'].str.replace('.', '-')
        # Заменяем строковый столбец с датой на datetime
        dat['Date'] = pd.to_datetime(dat['Date'], format='%d-%m-%Y', errors='coerce')
        return dat
    except Exception as e:
        st.error(f'Ошибка загрузки данных: {e}', icon="🚨")

st.subheader('📥🧹Загрузка и очистка данных из API Центрального банка🏛️')
st.markdown('##### 💱Обменные курсы валют')

# Создаем вкладки
t1, t2, t3, t4 = st.tabs(
    ["📶 Курс доллара 💲",
     "📶 Курс евро €",
     "📶 Курс фунта £",
     "📈 График",
     ])

# Даты начала и конца периода
d1 = '01/01/2020'
d2 = '21/04/2025'

# Использовать круговой спиннер
with st.spinner(text="📥Ждите, идет загрузка данных...", show_time=True):
    # Загрузка данных из API Центрального банка - курс$
    kod_val = 'R01235'  # Валюта $
    df_d = get_data(d1, d2, kod_val)

    # Загрузка данных из API Центрального банка - курс Евро
    kod_val = 'R01239'  # Евро
    df_e = get_data(d1, d2, kod_val)

    # Загрузка данных из API Центрального банка - курс фунта
    kod_val = 'R01035'  # Английский фунт
    df_f = get_data(d1, d2, kod_val)

# Вкладка с данными
with t1:
    # Контейнер для данных курс $
    with st.container(width=600):
        st.write('💲 Курс $ из API Центрального банка')
        st.write(df_d)

# Вкладка с данными
with t2:
    # Контейнер для данных курс евро
    with st.container(width=600):
        st.write('€ Курс евро из API Центрального банка')
        st.write(df_e)

# Вкладка с данными
with t3:
    # Контейнер для данных курс фунта
    with st.container(width=600):
        st.write('£ Курс фунта из API Центрального банка')
        st.write(df_f)

# Создать объект - График (фигура)
fig = go.Figure()
# Добавить на график элементы (линии)
fig.add_trace(go.Scatter(x=df_d['Date'], y=df_d['Value'], name='Курс доллара $'))
fig.add_trace(go.Scatter(x=df_e['Date'], y=df_e['Value'], name='Курс евро €'))
fig.add_trace(go.Scatter(x=df_f['Date'], y=df_f['Value'], name='Курс фунта £'))
tit = '📈Курсы валют из API Центрального банка с ' + d1 + ' по ' + d2
fig.update_layout(xaxis_title='Годы', yaxis_title='Курсы валют', title=tit)

# Вкладка с графиком
with t4:
    # Контейнер для графика
    with st.container(width=800, border=True):
        st.plotly_chart(fig, theme=None)