import streamlit as st
import graphviz

st.subheader('👁️ Визуализация графов с элементом st.graphviz_chart')

# Контейнер для графа
with st.container(width=800, border=True):
    st.write('🎋Графы с элементом st.graphviz_chart')
    # Вкладки страницы приложения
    tab1, tab2 = st.tabs(["👩🏻‍🤝‍👩🏼Граф 1 родственники", "🚌Граф2 маршрут"])
    with tab1:
        # Контейнер для графа
        with st.container(width=800, border=True):
            # Граф - родственники, как объект
            graph = graphviz.Digraph()
            graph.edge("Я", "Мать")
            graph.edge("Я", "Отец")
            graph.edge("Брат", "Мать")
            graph.edge("Брат", "Отец")
            graph.edge("Мать", "Бабушка по матери")
            graph.edge("Мать", "Дедушка по матери")
            graph.edge("Отец", "Бабушка по отцу")
            graph.edge("Отец", "Дедушка по отцу")
            graph.edge("Сестра", "Бабушка по матери")
            graph.edge("Сестра", "Бабушка по отцу")
            st.write('👩🏻‍🤝‍👩🏼Граф "Родственники"')
            st.graphviz_chart(graph)
    with tab2:
        # Контейнер для графа
        with st.container(width=300, border=True):
            st.write('🚌Граф "Кольцевой маршрут автобуса"')
            # Граф кольцевой маршрут, как текстовая строка
            st.graphviz_chart('''
                    digraph {
                        Вокзал -> Магазин
                        Аптека -> Вокзал
                        Магазин -> Рынок            
                        Рынок -> Стадион
                        Стадион -> Школа
                        Школа -> Магазин
                        Магазин -> Аптека                
                    }
                ''')