import streamlit as st
import pandas as pd

st.subheader('🐼Чтение данных Pandas из строки json')
# Создаем вкладки для данных
t1, t2 = st.tabs(["📶Набор данных DataFrame",
                  "📃Набор данных из строки json"])

# создаем DataFrame из словаря
data = {'Имя': ['Михаил', 'Елена', 'Василий'],
        'Возраст': [30, 25, 40],
        'Зарплата': [50000.0, 60000.0, 70000.0],
        'Дата': ['2025-01-01', '2025-02-15', '2025-03-30']}
df = pd.DataFrame(data)

# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.write(df)

# Запись набора данных в строковый объект
data_json = df.to_json(orient='index')
# Чтение набора данных из строкового объекта
df_r = pd.read_json(data_json, orient='index')

# Вкладка с данными
with t2:
    st.subheader('📃Набор данных из строки JSON - df_r')
    # Создать контейнер
    with st.container(width=500):
        st.write(df_r)