import streamlit as st
import pandas as pd

st.subheader('🐼Создание объектов DateFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3 = st.tabs(["ℹ️Индексная колонка",
                      "📶Набор данных DataFrame",
                      "ℹПоименованный индекс"])

# Вкладка с данными
with t1:
    st.subheader('ℹ️Индексная колонка - интервал дат')
    # Создать контейнер
    with st.container(width=200):
        # Создать индексную колонку с интервалом дат
        period = pd.date_range(start='2025/01/11', end='2025/01/20', freq='D')
        st.write(period)

# Вкладка с данными
with t2:
    st.subheader('📶Набор данных - DataFrame')
    # Создать контейнер
    with st.container(width=500):
        # Словарь данных
        # Количество элементов у каждого ключа должно быть одинаковым
        dic = {'col1': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
               'col2': [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
               'col3': [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
               }

        # Создать df
        df = pd.DataFrame(data=dic,
                          index=period,
                          columns=['col1', 'col2', 'col3'],
                          copy=True, dtype='float64')

        # Задать имя индексной колонке
        df.index.name = "Date"
        st.write(df)

        # Создать контейнер
        st.text('Типы данных в df')
        with st.container(width=300):
            st.text(df.dtypes)

# Вкладка с данными
with t3:
    st.subheader('ℹПоименованный индекс')
    # Создать контейнер
    with st.container(width=200):
        st.write(df.index)
        index_name = df.index.name
        st.write('Имя индекса - ', index_name)