import streamlit as st
import pandas as pd

st.subheader('🐼Работа с данными Pandas формата json')
# Создаем вкладки для данных
t1, t2 = st.tabs(["📶Набор данных DataFrame",
                  "📂Набор данных из файла json"])

# создаем DataFrame из словаря
data = {'Имя': ['Михаил', 'Елена', 'Василий'],
        'Возраст': [30, 25, 40],
        'Зарплата': [50000.0, 60000.0, 70000.0],
        'Дата': ['2025-01-01', '2025-02-15', '2025-03-30']}
df = pd.DataFrame(data)

# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.write(df)

# Путь к исходному csv файлу
path_json = 'csv/person.json'
# Сохранить данные в файл JSON
df.to_json(path_json, force_ascii=False)
# Прочитать данные из файла JSON
df_r = pd.read_json(path_json)

with t2:
    st.subheader('📂Набор данных из файла JSON - df_r')
    with st.container(width=500):
        st.write(df_r)