import streamlit as st
import pandas as pd

st.subheader('🐼Агрегация DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3 = st.tabs(
    ["📶Исходный DataFrame",
     "🏙️Площадь городов",
     "👬🏻Население городов",
     ])

df = pd.DataFrame({
    'Столица': ['Лондон', 'Париж', 'Токио', 'Берлин', 'Рим', 'Москва'],
    'Население': [8908081, 2140526, 13929286, 3748148, 2870493, 13149803],
    'Площадь': [1572, 105.4, 2190.93, 891.68, 1285.31, 2561.5],
    })

# Вкладка с данными
with t1:
    st.subheader('📶Исходный DataFrame')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('🏙️Данные по площади')
    # Создать контейнер
    with st.container(width=300):
        # Вычисляем параметры площади
        aggregated_data = df.agg({'Площадь': ['max', 'min', 'sum']})
        st.dataframe(aggregated_data)

# Вкладка с данными
with t3:
    st.subheader('👬🏻Данные по населению')
    # Создать контейнер
    with st.container(width=300):
        # Вычисляем параметры населения
        aggregated_data = df.agg({'Население': ['max', 'min', 'sum']})
        st.dataframe(aggregated_data)