import streamlit as st
import pandas as pd

st.subheader('🐼Манипуляция данными DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3, t4, t5 = st.tabs(
    ["📶Исходный DataFrame",
     "🔁Изменение типа",
     "❎Умножение ячеек",
     "✂️↕️Деление столбца",
     "↔️❎Умножение строки",
     ])

# Создаем DataFrame
df = pd.DataFrame({'Яблоки': [10, 20, 30],
                    'Груши': [40, 50, 60],
                    'Сливы': ['70.7', '80.8', '90.9']})
# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('🔁Столбец "Сливы" делаем цифровым')
    # Создать контейнер
    with st.container(width=500):
        # Применяем функцию к одному столбцу DataFrame
        df["Сливы"] = pd.to_numeric(df["Сливы"])
        st.dataframe(df)

# Вкладка с данными
with t3:
    st.subheader('❎Все ячейки умножаем на 2')
    # Создать контейнер
    with st.container(width=500):
        # Применяем функцию к каждому элементу DataFrame
        df = df.apply(lambda x: x * 2)
        st.dataframe(df)

# Вкладка с данными
with t4:
    st.subheader('✂️↕️Столбец Яблоки делим на 2')
    # Создать контейнер
    with st.container(width=500):
        # Применяем функцию к одному столбцу DataFrame
        df['Яблоки'] = df['Яблоки'].apply(lambda x: x / 2)
        st.dataframe(df)

# Вкладка с данными
with t5:
    st.subheader('↔️❎↕Вторую строку умножаем на 10')
    # Создать контейнер
    with st.container(width=500):
        # Применяем функцию ко второй строке
        df.loc[1] = df.loc[1].apply(lambda x: x * 10)
        st.dataframe(df)