import streamlit as st
import pandas as pd

st.subheader('🐼Фильтрация данных DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3, t4 = st.tabs(["📶Набор данных DataFrame",
                          "👺Фильтр по маске",
                          "🕵🏻Простой фильтр",
                          "🎭Комбинированный фильтр"
                          ])

# Создаем DataFrame из словаря
data = {'Имя': ['Антон', 'Наташа', 'Максим', 'Марина'],
        'Возраст': [25, 40, 28, 35],
        'Город': ['Сочи', 'Казань', 'Саратов', 'Москва']}
df = pd.DataFrame(data)
# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('👺Фильтр по маске')
    # Создать контейнер
    with st.container(width=500):
        # Фильтр по маске
        mask = df['Возраст'] < 30
        df_filter = df[mask]
        st.dataframe(df_filter)

# Вкладка с данными
with t3:
    st.subheader('🕵🏻Простой фильтр')
    # Создать контейнер
    with st.container(width=500):
        # Простой фильтр
        df_filter1 = df[df['Возраст'] > 30]
        st.dataframe(df_filter1)

# Вкладка с данными
with t4:
    st.subheader('🎭Комбинированный фильтр')
    # Создать контейнер
    with st.container(width=500):
        # Комбинированный фильтр
        df_filter2 = df[(df['Возраст'] > 30) & (df['Город'] == 'Москва')]
        st.write(df_filter2)