import streamlit as st
import pandas as pd

st.subheader('🐼Группировка и агрегация DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, = st.tabs(
    ["📶Исходный DataFrame",
     "🍰Средняя цена",
     ])

# Создать набор данных
df = pd.DataFrame({'Продукт': ['Пирожные', 'Пирожные', 'Конфеты', 'Конфеты', 'Конфеты'],
                    'Название': ['Шоколадное', 'Ванильное', 'Белочка', 'Грильяж', 'Ласточка'],
                    'Цена': [80, 90, 300, 400, 200]})

# Вкладка с данными
with t1:
    st.subheader('📶Исходный DataFrame')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('🍰Средняя цена продукта')
    # Создать контейнер
    with st.container(width=300):
        # Группируем данные по столбцу 'Продукт' и вычисляем среднюю цену
        grouped_data = df.groupby('Продукт').agg({'Цена': 'mean'})
        st.dataframe(grouped_data)