import streamlit as st
import pandas as pd

st.subheader('🐼Сводная таблица PivotTables в Pandas')
# Создаем вкладки для данных
t1, t2, t3, t4, t5 = st.tabs(
    ["📶Исходный DataFrame",
     "🍎По продукту",
     "🛍️По категории",
     "🛍️🍎По категории и продукту",
     "🧾🛍Параметры категорий",
     ])

# Создание набора данных
df = pd.DataFrame({'Продукты': ['Морковь', 'Капуста', 'Яблоки', 'Груши'],
                   'Категории': ['Овощи', 'Овощи', 'Фрукты', 'Фрукты'],
                   'Количество': [8, 5, 3, 4],
                   'Сумма': [270, 239, 617, 384]})

# Вкладка с данными
with t1:
    st.subheader('📶Исходный DataFrame')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('🍎Сумма по каждому продукту')
    # Создать контейнер
    with st.container(width=300):
        pivot = df.pivot_table(index=['Продукты'],
                               values=['Сумма'],
                               aggfunc='sum')
        st.write(pivot)

# Вкладка с данными
with t3:
    st.subheader('🛍️️Сумма по категории продукта')
    # Создать контейнер
    with st.container(width=300):
        pivot = df.pivot_table(index=['Категории'],
                               values=['Сумма'],
                               aggfunc='sum')
        st.write(pivot)

# Вкладка с данными
with t4:
    st.subheader('🛍️🍎Сумма по категории и продукту')
    # Создать контейнер
    with st.container(width=300):
        pivot = df.pivot_table(index=['Продукты', 'Категории'],
                               values=['Сумма'], aggfunc='sum')
        st.write(pivot)

# Вкладка с данными
with t5:
    st.subheader('🧾🛍️Параметры категории продукта')
    # Создать контейнер
    with st.container(width=300):
        pivot = df.pivot_table(index=['Категории'], values=['Сумма'],
                               aggfunc=['median', 'max', 'min'])
        st.write(pivot)