import streamlit as st
import pandas as pd

st.subheader('🐼Выборка данных из DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3 = st.tabs(["📶Набор данных DataFrame",
                      "↕️Выбор колонок",
                      "📃Выбор строки и ячейки"
                      ])
# создаем DataFrame из словаря
data = {'Имя': ['Антон', 'Наташа', 'Максим', 'Марина'],
        'Возраст': [25, 40, 28, 35],
        'Город': ['Сочи', 'Казань', 'Саратов', 'Москва']}
df = pd.DataFrame(data)

# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('↕️Выбор колонок: Имя, Город')
    # Создать контейнер
    with st.container(width=500):
        # Выбор колонок
        df_col = df[['Имя', 'Город']]
        st.dataframe(df_col)

# Выбор строки
df_str = df.iloc[1]
# Выбор ячейки
df_str_col = df.iloc[2, 2]

# Вкладка с данными
with t3:
    st.subheader('📃Выбор строки и ячейки')
    # Создать контейнер
    with st.container(width=500):
        st.badge('↔️Выбор строки с индексом - 1')
        st.text(df_str)
        st.badge('📥Выбор ячейки с индексом - [2:2]')
        st.write(df_str_col)