import streamlit as st
import pandas as pd

st.subheader('🐼Работа с данными Pandas формата CSV')
# Создаем вкладки для данных
t1, t2, t3 = st.tabs(["📶Набор данных DataFrame",
                      "📂Набор данных из csv файла",
                      "👨🏻‍🔧DataFrame после обработки"])

# создаем DataFrame из словаря
data = {'Имя': ['Антон', 'Наташа', 'Максим', 'Марина'],
        'Возраст': [25, 30, 28, 35],
        'Город': ['Москва', 'Казань', 'Саратов', 'Сочи']}
df = pd.DataFrame(data)

# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.write(df)

# Путь к csv файлу
path_csv = 'csv/person.csv'
# Сохранить данные в файл CSV
df.to_csv(path_csv)
# Прочитать данные из файла CSV
df_r = pd.read_csv(path_csv)

# Вкладка с данными
with t2:
    st.subheader('📂Набор данных из csv файла - df_r')
    # Создать контейнер
    with st.container(width=500):
        st.write(df_r)


# Убрать лишнюю колонку
df_n = df_r.loc[:, ['Имя', 'Возраст', 'Город']]
# Вкладка с данными
with t3:
    st.subheader('👨🏻‍🔧Набор данных после преобразования - df_n')
    # Создать контейнер
    with st.container(width=500):
        st.write(df_n)