import streamlit as st
import pandas as pd

st.subheader('🐼Агрегация данных DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3, t4, t5 = st.tabs(
    ["📶Исходный DataFrame",
     "∑↕️Сумма",
     "🎯↕️Среднее",
     "〽️↕️Минимум",
     "𝕄𝕒𝕩↕️Максимум",
     ])

# Вкладка с данными
with t1:
    st.subheader('📶Исходный DataFrame')
    # Создать контейнер
    with st.container(width=500):
        df = pd.DataFrame({'Яблоки': [10, 20, 30],
                           'Груши': [40, 50, 60],
                           'Сливы': [70, 80, 90]})
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('∑↕️Сумма столбца')
    # Создать контейнер
    with st.container(width=300):
        st.dataframe(df.sum())

# Вкладка с данными
with t3:
    st.subheader('🎯↕️Среднее столбца')
    # Создать контейнер
    with st.container(width=300):
        st.dataframe(df.mean())

# Вкладка с данными
with t4:
    st.subheader('〽️↕️Минимум столбца')
    # Создать контейнер
    with st.container(width=300):
        st.dataframe(df.min())

# Вкладка с данными
with t5:
    st.subheader('𝕄𝕒𝕩️↕️Максимум столбца')
    # Создать контейнер
    with st.container(width=300):
        st.dataframe(df.max())