import streamlit as st
import pandas as pd

st.subheader('🐼Манипуляция данными DataFrame в Pandas')
# Создаем вкладки для данных
t1, t2, t3 = st.tabs(["📶Набор данных DataFrame",
                      "↕️Удаление колонок",
                      "↔️Удаление строк"
                      ])

# Создаем DataFrame
df = pd.DataFrame({'А': [10, 20, 30],
                   'Б': [45, 55, 65],
                   'В': [74, 85, 96],
                   'Г': [94, 35, 66]})
# Вкладка с данными
with t1:
    st.subheader('📶Созданный набор данных - df')
    # Создать контейнер
    with st.container(width=500):
        st.dataframe(df)

# Вкладка с данными
with t2:
    st.subheader('↕️Удаленны столбцы A и B')
    # Создать контейнер
    with st.container(width=500):
        # Удаляем столбцы 'A' и 'B'
        df_drop_col = df.drop(['А', 'В'], axis=1)
        st.dataframe(df_drop_col)

# Вкладка с данными
with t3:
    st.subheader('↔️Удаленны строки 0 и 1')
    # Создать контейнер
    with st.container(width=500):
        # Удаляем строки 0 и 1
        df_drop_row = df.drop([0, 1], axis=0)
        st.write(df_drop_row)