import streamlit as st
import pandas as pd
import requests
import json

# Функция загрузки данных с кэшированием
@st.cache_data
def get_data(group_type):
    try:
        # Формирование URL адреса
        url = f"https://www.imf.org/external/datamapper/api/v1/{group_type}"
        # Запрос к API
        response = requests.get(url)
        # Извлечение текста из формата JSON
        resp_txt = json.loads(response.text)
        # Разбор полученных данных
        results = [
            {"id": key, **values} for key, values in resp_txt[group_type].items()
        ]
        # Создание DataFrame
        df = pd.DataFrame.from_records(results)
        return df
    except Exception as e:
        st.error(f'Ошибка загрузки данных: {e}', icon="🚨")

st.subheader('🌍Загрузка списка регионов МВФ (IMF)🏦')

# Использовать круговой спиннер
with st.spinner(text="📥Ждите, идет загрузка данных...", show_time=True):
    # Группы
    df_g = get_data('groups')
    # Регионы
    df_r = get_data('regions')
    # Страны
    df_c = get_data('countries')

# Вкладки верхнего уровня
tb1, tb2, tb3 = st.tabs([
    "🌐📈Аналитические группы",
    "🌐🗾Географические регионы",
    "🌐🏙️Страны"
    ])

# Вкладка с данными для аналитических групп ----------------
with tb1:
    st.markdown('#### 🌐📈Аналитические группы')
    # Создаем вкладки для данных
    t1, t2 = st.tabs([
        "📃Столбцы набора данных",
        "📶Идентификаторы и метки данных"
        ])
    # Вкладка с данными
    with t1:
        st.markdown('##### 📖Имена столбцов')
        # Создать контейнер
        with st.container(width=200):
            st.write(df_g.columns)

    # Вкладка с данными
    with t2:
        st.markdown('##### 📶Идентификаторы и метки аналитических групп в API МВФ')
        # Создать контейнер
        with st.container(width=500):
            st.write(df_g)

# Вкладка с данными для географических регионов ----------------
with tb2:
    st.subheader('🌐🗾Регионы (континенты)')
    # Создаем вкладки для данных
    t1, t2 = st.tabs([
        "📃Столбцы набора данных",
        "📶Идентификаторы и метки данных"
        ])
    # Вкладка с данными
    with t1:
        st.markdown('##### 📖Имена столбцов')
        # Создать контейнер
        with st.container(width=200):
            st.write(df_r.columns)

    # Вкладка с данными
    with t2:
        st.markdown('##### 📶Идентификаторы и метки географических регионов в API МВФ')
        # Создать контейнер
        with st.container(width=500):
            st.write(df_r)

# Вкладка с данными для стран-------------------
with tb3:
    st.subheader('🌐🏙️Страны')
    # Создаем вкладки для данных
    t1, t2 = st.tabs([
        "📃Столбцы набора данных",
        "📶Идентификаторы и метки данных"
        ])
    # Вкладка с данными
    with t1:
        st.markdown('##### 📖Имена столбцов')
        # Создать контейнер
        with st.container(width=200):
            st.write(df_c.columns)

    # Вкладка с данными
    with t2:
        st.markdown('##### 📶Идентификаторы и метки стран в API МВФ')
        # Создать контейнер
        with st.container(width=500):
            st.write(df_c)