import streamlit as st
import plotly.express as px
import pandas as pd

st.subheader('📈Графики с Plotly Express')
# Создаем вкладки
t1, t2 = st.tabs(
    ["📶Набор данных DadaFrame",
     "📊 Столбчатая диаграмма",
     ])

# Вкладка с данными
with t1:
    # Контейнер для данных
    with st.container(width=400, border=True):
        # Годы
        x = [2020, 2021, 2022, 2023, 2024, 2025]
        # Население
        y = [800, 850, 900, 1100, 1150, 1200]
        df = pd.DataFrame({'Годы': x,
                           'Население, тыс.чел.': y}
                          )
        st.write('📶Набор данных DataFrame')
        st.write(df)

# Вкладка с графиком
with t2:
    # Контейнер для графика
    with st.container(width=600, border=True):
        st.write('📊Столбчатая диаграмма')
        fig = px.bar(x=x, y=y,
                     title='Динамика изменения населения',
                     labels={'y': 'Население, тыс.чел.', 'x': 'Годы'})
        st.plotly_chart(fig, theme=None)