import streamlit as st
import pandas as pd

st.subheader('📊Столбчатая диаграмма c элементом st.bar_chart')
# Создаем вкладки
t1, t2 = st.tabs(
    ["📶 Набор данных DadaFrame",
     "📊 Столбчатая диаграмма",
     ])

# Создание набора данных
df = pd.DataFrame({
    'Фрукты': ['Яблоки', 'Груши', 'Бананы', 'Апельсины'],
    'Количество': [15, 35, 25, 45]
})

# Вкладка с данными
with t1:
    # Контейнер для данных
    with st.container(width=300):
        st.write('📶Набор данных df')
        st.write(df)

# Вкладка с графиком
with t2:
    # Контейнер для графика
    with st.container(width=600, border=True):
        st.write('📊Столбчатая диаграмма st.bar_chart')
        st.bar_chart(df, x='Фрукты', y='Количество')