import streamlit as st
import pandas as pd

st.subheader('📈Линейная диаграмма с st.line_chart')
# Создаем вкладки
t1, t2 = st.tabs(
    ["📶 Набор данных DadaFrame",
     "📈 Линейная диаграмма",
     ])

# Вкладка с данными
with t1:
    # Контейнер для данных
    with st.container(width=300):
        # Создание набора данных
        df = pd.DataFrame({'Годы': ['2018', '2019', '2020', '2021'],
                           'Продажи': [350, 480, 550, 680]}
                          )
        st.write('📶Набор данных df')
        st.write(df)

# Вкладка с графиком
with t2:
    # Контейнер для графика
    with st.container(width=600, border=True):
        st.write('📈Линейная диаграмма st.line_chart')
        st.line_chart(df, x='Годы', y='Продажи',
                      x_label='Годы', y_label='Продажи')