import streamlit as st
import pandas as pd

st.subheader('📈Диаграмма областей с элементом st.area_chart')
# Создаем вкладки
t1, t2 = st.tabs(
    ["📶 Набор данных DadaFrame",
     "📈 Диаграмма областей",
     ])

# Вкладка с данными
with t1:
    # Контейнер для данных
    with st.container(width=300):
        # Создание набора данных
        data = {"col1": [23, 12, 78, 4, 54],
                "col2": [0, 13, 88, 51, 3],
                "col3": [45, 2, 46, 67, 56]}
        df = pd.DataFrame(data)
        st.write('📶Набор данных df')
        st.write(df)

# Вкладка с графиком
with t2:
    # Контейнер для графика
    with st.container(width=600, border=True):
        st.write('📈Диаграмма областей (площадей) st.area_chart')
        st.area_chart(df)